<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [220]:
import pandas as pd
import psycopg2

In [221]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [222]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [223]:
# текст запроса
query_3_1 = f'''select count(id)
from public.vacancies
'''
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df = pd.read_sql_query(query_3_1, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\942019622.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

In [224]:
# результат запроса
display(df)
# 49197

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [225]:
# текст запроса
query_3_2 = f'''select count(emp.id)
from public.employers as emp
'''
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df2 = pd.read_sql_query(query_3_2, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\811413657.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql_query(query_3_2, connection)

In [226]:
# результат запроса
display(df2)
# 23501

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [227]:
# текст запроса
query_3_3 = f'''select count(ar.id)
from public.AREAS as ar
'''
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df3 = pd.read_sql_query(query_3_3, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\93030133.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df3 = pd.read_sql_query(query_3_3, connection)

In [228]:
# результат запроса
display(df3)
# 1362

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [229]:
# текст запроса
query_3_4 = f'''select count(ind.id)
from public.industries as ind
'''
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df4 = pd.read_sql_query(query_3_4, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\1627922953.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4 = pd.read_sql_query(query_3_4, connection)

In [230]:
# результат запроса
display(df4)
# 294

   count
0    294

In [231]:
# выводы по предварительному анализу данных
print('Представленный набор данных имеет более 49 тыс. вакансий, 23.5 тыс. работодателей, 294 сферы деятельности\
      представленные в более чем 1,3 тысячах регионах. Данные достаточны для последующего исследования и анализа.')

Представленный набор данных имеет более 49 тыс. вакансий, 23.5 тыс. работодателей, 294 сферы деятельности      представленные в более чем 1,3 тысячах регионах. Данные достаточны для последующего исследования и анализа.

#### Представленный набор данных имеет более 49 тыс. вакансий, 23.5 тыс. работодателей, 294 сферы деятельности  представленные в более чем 1,3 тысячах регионах. Данные достаточны для последующего исследования и анализа.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [232]:
# текст запроса
query_4_1 = f'''select count(v.id) as cnt, ar.name as area
       from public.AREAS as ar
join public.VACANCIES as v on v.area_id = ar.id
group by ar.name
order by count(v.id) desc
limit 5'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df4_1 = pd.read_sql_query(query_4_1, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\3186920139.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4_1 = pd.read_sql_query(query_4_1, connection)

In [233]:
# результат запроса
display(df4_1)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [234]:
# текст запроса
query_4_2 = f'''select count(v.id) as cnt
       from public.VACANCIES as v
where (v.salary_to is not null or v.salary_from is not null)
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df4_2 = pd.read_sql_query(query_4_2, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\1706111799.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4_2 = pd.read_sql_query(query_4_2, connection)

In [235]:
# результат запроса
display(df4_2)

     cnt
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [236]:
# текст запроса
query_4_3_4 = f'''select 
                        round(avg(v.salary_to), 0) as avg_up,
                        round(avg(v.salary_from), 0) as avg_down
       from public.VACANCIES as v
where (v.salary_to is not null or v.salary_from is not null)'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df4_3_4 = pd.read_sql_query(query_4_3_4, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\2964215530.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4_3_4 = pd.read_sql_query(query_4_3_4, connection)

In [237]:
# результат запроса
display(df4_3_4)

     avg_up  avg_down
0  110537.0   71065.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [238]:
# текст запроса
query_4_5 = f'''select 
                        v.schedule as schedule,
                        v.employment as employment, 
                        count((v.schedule, v.employment))
       from public.VACANCIES as v
group by (v.schedule, v.employment)
order by count((v.schedule, v.employment)) desc 
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df4_5 = pd.read_sql_query(query_4_5, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\361092211.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4_5 = pd.read_sql_query(query_4_5, connection)

In [239]:
# результат запроса
display(df4_5)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [240]:
# текст запроса
query_4_5_1 = f'''select 
                        v.experience as experience
       from public.VACANCIES as v
       group by v.experience
       order by count(v.experience) asc
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df4_5_1 = pd.read_sql_query(query_4_5_1, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\3452688140.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4_5_1 = pd.read_sql_query(query_4_5_1, connection)

In [241]:
# результат запроса
display(df4_5_1)

           experience
0         Более 6 лет
1           Нет опыта
2       От 3 до 6 лет
3  От 1 года до 3 лет

***

In [242]:
# выводы по детальному анализу вакансий
print('Детальный анализ вакансий показывает, что в более чем половине вакансий набора данных указаны оба поля\
      с заработной платой, которые в усредненном виде предствалены 110537.0 и 71065.0 соотвественно,\ при том что,\
      наибольшее количество вакансий представлено в крупных городах-миллионниках политических и экономических центрах\
      наиболее востребованными специалистами на рынке труда являются специалситы и работники\
      с опытом работы от 1 года до 6 лет. Наибольшее количество вакансий с типом трудоустворойства - полная занятость.')

Детальный анализ вакансий показывает, что в более чем половине вакансий набора данных указаны оба поля      с заработной платой, которые в усредненном виде предствалены 110537.0 и 71065.0 соотвественно,\ при том что,      наибольшее количество вакансий представлено в крупных городах-миллионниках политических и экономических центрах      наиболее востребованными специалистами на рынке труда являются специалситы и работники      с опытом работы от 1 года до 6 лет. Наибольшее количество вакансий с типом трудоустворойства - полная занятость.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [243]:
# текст запроса
query_5_1 = f'''(select 
                        emp.name as name,
                        count(v.id) as count
       from public.VACANCIES as v
       join public.EMPLOYERS as emp on emp.id = v.employer_id
       group by emp.name
       order by count(v.id) desc 
       offset 0
       limit 1)
       union 

                  (select 
                        emp.name as name,
                        count(v.id) as count
       from public.VACANCIES as v
       join public.EMPLOYERS as emp on emp.id = v.employer_id
       group by emp.name
       order by count(v.id) desc 
       offset 4
       limit 1)
       order by 1 desc
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_5_1 = pd.read_sql_query(query_5_1, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\1772464878.py:26: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_1 = pd.read_sql_query(query_5_1, connection)

In [244]:
# результат запроса
display(df_5_1)

            name  count
0         Яндекс   1933
1  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [245]:
# текст запроса
query_5_2 = f'''select distinct 
                     ar.name as name,
                     emp.area as name,
                     cnt_vac,
                     cnt_emploers,
                     count(emp.id) as cnt_employers
from (
       (select
                            distinct 
                        v.area_id as id,
                        count(distinct v.id) as cnt_vac,
                        count(distinct v.employer_id) as cnt_emploers
       from public.VACANCIES as v
       
       group by 1)
       
) AS tab
full join public.EMPLOYERS as emp on emp.id = cnt_emploers
full join public.AREAS as ar on ar.id = emp.area
group by 1, cnt_vac, cnt_emploers, emp.id
having (cnt_vac is null or cnt_vac = 0) and  (count(emp.id) > 0) and (count(emp.id) < 1000) 
order by 5 desc 
'''


'having ((cnt_vac) = 0 or cnt_vac is null)'
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_5_2 = pd.read_sql_query(query_5_2, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\3945818439.py:29: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_2 = pd.read_sql_query(query_5_2, connection)

In [246]:
# результат запроса
display(df_5_2)

                                name  name cnt_vac cnt_emploers  cnt_employers
0                             Абакан   103    None         None              1
1                             Абинск  1439    None         None              1
2                          Австралия     6    None         None              1
3                            Австрия     7    None         None              1
4                              Агрыз  1625    None         None              1
..                               ...   ...     ...          ...            ...
649  Яблоновский (Республика Адыгея)  2954    None         None              1
650                           Якутск    80    None         None              1
651                             Ялта  2120    None         None              1
652                        Ярославль   112    None         None              1
653              Ярославская область  1806    None         None              1

[654 rows x 5 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [247]:
# текст запроса
query_5_3 = f'''select distinct
                        emp.name as name,
                        v.employer_id as employer,
                        count(distinct v.area_id) as reg_vac
       from public.VACANCIES as v
       left join public.EMPLOYERS as emp on emp.id = v.employer_id
       group by 1, 2
       order by 3 desc
       limit 10
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_5_3 = pd.read_sql_query(query_5_3, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\2783700579.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_3 = pd.read_sql_query(query_5_3, connection)

In [248]:
# результат запроса
display(df_5_3)

                         name  employer  reg_vac
0                      Яндекс      1740      181
1                  Ростелеком      2748      152
2                  Спецремонт   5724811      116
3      Поляков Денис Иванович   5130287       88
4                   ООО ЕФИН    3682876       71
5                  Совкомбанк      7944       63
6                         МТС      3776       55
7  ЭФКО, Управляющая компания     53797       49
8                        КРОН   3776815       48
9                Почта России      4352       48

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [249]:
# текст запроса
query_5_4 = f'''select 
                        e_ind.industry_id,
                        count(distinct emp.id) as employer
       from public.EMPLOYERS as emp
       left join public.EMPLOYERS_INDUSTRIES as e_ind on e_ind.employer_id = emp.id
       where e_ind.industry_id is null
       group by 1
'''
# 4959
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_5_4 = pd.read_sql_query(query_5_4, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\2826324923.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_4 = pd.read_sql_query(query_5_4, connection)

In [250]:
# результат запроса
display(df_5_4)

  industry_id  employer
0        None      8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [251]:
# текст запроса
query_5_5 = f'''select 
                        emp.name,
                        count(distinct e_ind.industry_id)
       from public.EMPLOYERS as emp
       left join public.EMPLOYERS_INDUSTRIES as e_ind on e_ind.employer_id = emp.id
       group by 1
       having count(distinct e_ind.industry_id) = 4
       offset 2
       limit 1
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_5_5 = pd.read_sql_query(query_5_5, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\2662140782.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_5 = pd.read_sql_query(query_5_5, connection)

In [252]:
# результат запроса
display(df_5_5)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [253]:
# текст запроса
query_5_6 = f'''select
                        count(distinct emp.id)
       from public.EMPLOYERS as emp
       join public.EMPLOYERS_INDUSTRIES as e_ind on e_ind.employer_id = emp.id
       join public.INDUSTRIES as ind on ind.id = e_ind.industry_id
       where ind.name = ('Разработка программного обеспечения')::text
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_5_6 = pd.read_sql_query(query_5_6, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\3878978002.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_6 = pd.read_sql_query(query_5_6, connection)

In [254]:
# результат запроса
display(df_5_6)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [255]:
# код для получения списка городов-милионников
query_5_7= f'''select distinct ar.name as city_mill
       from public.AREAS as ar 
       where ar.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург',
       'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа',
       'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')
'''
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_5_7 = pd.read_sql_query(query_5_7, connection)


query_5_8= f'''select distinct 
                     ar.name as city_name,
                     count(vac.id)
       from public.EMPLOYERS as emp
       left join public.vacancies as vac on vac.employer_id = emp.id
       JOIN public.areas as ar on ar.id = vac.area_id
       where emp.name = 'Яндекс' and ar.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург',
       'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа',
       'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')
       group by 1
       
union all

(select distinct
                     'Total',
                     count((vac.id))
       from public.EMPLOYERS as emp
       left join public.vacancies as vac on vac.employer_id = emp.id
       JOIN public.areas as ar on ar.id = vac.area_id
       where emp.name = 'Яндекс' and ar.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург',
       'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа',
       'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград'))
order by 2 asc
'''


# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_5_8 = pd.read_sql_query(query_5_8, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\4027167643.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_7 = pd.read_sql_query(query_5_7, connection)
C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\4027167643.py:39: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_8 = pd.read_sql_query(query_5_8, connection)

In [256]:
# результат запроса
display(df_5_7)

          city_mill
0         Волгоград
1           Воронеж
2      Екатеринбург
3            Казань
4         Краснодар
5        Красноярск
6            Москва
7   Нижний Новгород
8       Новосибирск
9              Омск
10            Пермь
11   Ростов-на-Дону
12           Самара
13  Санкт-Петербург
14              Уфа
15        Челябинск

In [257]:
# результат запроса
display(df_5_8)

          city_name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            Total    485

***

In [258]:
# выводы по анализу работодателей
print('Анализ работодателей показывает, что первые пять мест по количеству ваканчий имеют от 1933 до 331 количества вакансий\
      у компаний Газпром нефть и Яндекс соотвественно. Для населенных пунктов метного значения характерно\
      наличие малого количества вакансий. Наибольшее количестве регионов публикуют компании работающие в IT-секторе.\
      у более чем 3,5 тыс. работодателей в качетсве направления деятельности указана разработка программного обеспечения.\
      Широкое число сфер деятельности также характерно для IT-компаний. ДЛя ведущей IT-компании РФ характерно широкое\
      представительство в города-миллионниках РФ с значительным количеством открытых вакансий: почти 500 вакансий.\
      При этом у почти 8.5 тыс. работодателей не указана сфера деятельности.')

Анализ работодателей показывает, что первые пять мест по количеству ваканчий имеют от 1933 до 331 количества вакансий      у компаний Газпром нефть и Яндекс соотвественно. Для населенных пунктов метного значения характерно      наличие малого количества вакансий. Наибольшее количестве регионов публикуют компании работающие в IT-секторе.      у более чем 3,5 тыс. работодателей в качетсве направления деятельности указана разработка программного обеспечения.      Широкое число сфер деятельности также характерно для IT-компаний. ДЛя ведущей IT-компании РФ характерно широкое      представительство в города-миллионниках РФ с значительным количеством открытых вакансий: почти 500 вакансий.      При этом у почти 8.5 тыс. работодателей не указана сфера деятельности.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [259]:
# текст запроса
query_6_1 = f'''select 
                     count(v.name)
       from public.vacancies as v
       where (((lower(v.name)::text) like '%данн%')
       or ((lower(v.name)::text) like '%data%')
       or ((lower(v.name)::text) like 'data%')
       or ((lower(v.name)::text) like '%data')
       or ((lower(v.name)::text) like 'данн%')
       or (lower(v.name)::text like '%данн'))
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_6_1 = pd.read_sql_query(query_6_1, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\1645064311.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_1 = pd.read_sql_query(query_6_1, connection)

In [260]:
# результат запроса()
display(df_6_1)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [261]:
# текст запроса
query_6_2 = f'''select
                     count(v.name)
       from public.vacancies as v
       where (lower(v.name) like '%data%scientist%'
       or lower(v.name) like '%data%science%'
       or lower(v.name) like '%исследователь%данных%'
       or (v.name like '%ML%' and v.key_skills not like '%HTML%')
       or lower(v.name) like '%machine%learning%' or lower(v.name) like '%машинн%обучен%')
       and (lower(v.name) like '%junior%'
       or lower(v.experience) like '%нет опыта%'
       or lower(v.name) like '%junior%'
       or lower(v.name) like '%стажёр%'
       or lower(v.name) like '%стаж%р%'
       or lower(v.employment) like '%стажировка%'
       or v.employment like '%Cтажировка%')
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_6_2 = pd.read_sql_query(query_6_2, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\3176200313.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_2 = pd.read_sql_query(query_6_2, connection)

In [262]:
# результат запроса()
display(df_6_2)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [263]:
# текст запроса
query_6_3 = f'''select
                     count(v.id)
       from public.vacancies as v
       where (lower(v.name) like '%data%scientist%'
       or lower(v.name) like '%data%science%'
       or lower(v.name) like '%исследователь%данных%'
       or (v.name like '%ML%' and v.key_skills not like '%HTML%')
       or lower(v.name) like '%machine%learning%'
       or lower(v.name) like '%машинн%обучен%')
       and (v.key_skills like '%SQL%'
       or lower(v.key_skills) like '%postgres%') 
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_6_3 = pd.read_sql_query(query_6_3, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\3852135415.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_3 = pd.read_sql_query(query_6_3, connection)

In [264]:
# результат запроса
display(df_6_3)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [265]:
# текст запроса
query_6_4 = f'''select
                     count(v.id)
       from public.vacancies as v
       where (lower(v.name) like '%data%scientist%'
       or lower(v.name) like '%data%science%'
       or lower(v.name) like '%исследователь%данных%'
       or (v.name like '%ML%' and v.key_skills not like '%HTML%')
       or lower(v.name) like '%machine%learning%'
       or lower(v.name) like '%машинн%обучен%')
       and (v.key_skills like '%Python%'
       or lower(v.key_skills) like '%python%') 
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_6_4 = pd.read_sql_query(query_6_4, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\3623244986.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_4 = pd.read_sql_query(query_6_4, connection)

In [266]:
# результат запроса
display(df_6_4)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [267]:
# текст запроса
query_6_5 = f'''select
                     (
                     (
                     length(v.key_skills) - length(REPLACE(v.key_skills, '\t', ''))
                     + (
                            length(v.key_skills) - length(REPLACE(v.key_skills, ',', ''))/count(*))
                     from public.vacancies as v                                
       where (lower(v.name) like '%data%scientist%'
       or lower(v.name) like '%data%science%'
       or lower(v.name) like '%исследователь%данных%'
       or (v.name like '%ML%' and v.key_skills not like '%HTML%')
       or lower(v.name) like '%machine%learning%'
       or lower(v.name) like '%машинн%обучен%')
'''
# 5.417607
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_6_5 = pd.read_sql_query(query_6_5, connection)

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\1687094591.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_5 = pd.read_sql_query(query_6_5, connection)

DatabaseError: Execution failed on sql 'select
                     (
                     (
                     length(v.key_skills) - length(REPLACE(v.key_skills, '	', ''))
                     + (
                            length(v.key_skills) - length(REPLACE(v.key_skills, ',', ''))/count(*))
                     from public.vacancies as v
       where (lower(v.name) like '%data%scientist%'
       or lower(v.name) like '%data%science%'
       or lower(v.name) like '%исследователь%данных%'
       or (v.name like '%ML%' and v.key_skills not like '%HTML%')
       or lower(v.name) like '%machine%learning%'
       or lower(v.name) like '%машинн%обучен%')
': syntax error at or near "from"
LINE 7:                      from public.vacancies as v             ...
                             ^

In [ ]:
# результат запроса
display(df_6_5)
print(5.417607+0.097065)
# 5.514672

        avg       avg
0  5.417607  0.097065

5.514672

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:

query_6_6 = f'''
select  
        Table_A.experience,
        avg(Table_A.avarage_salary)
from (
select                 
                      v.experience,
                     (((v.salary_from) + (v.salary_to)))/2 as avarage_salary, 
                     count(((v.salary_from) + (v.salary_to))),
                     sum(((v.salary_from) + (v.salary_to)))
                     from public.vacancies as v                                
       where (v.salary_from is not null and v.salary_to is not null) and v.experience = ('От 3 до 6 лет')
       
       and (
               (lower(v.name) like '%data%scientist%'
               or lower(v.name) like '%data%science%'
               or lower(v.name) like '%исследователь%данных%'
               or (v.name like '%ML%' and v.key_skills not like '%HTML%')
               or lower(v.name) like '%machine%learning%'
               or lower(v.name) like '%машинн%обучен%')
                )
group by 1, 2


union all

select                  
                     v.experience,
                     (COALESCE(v.salary_from, 0) + COALESCE(v.salary_to, 0)) as avarage_salary,
                     count((COALESCE(v.salary_from, 0) + COALESCE(v.salary_to, 0))),
                     sum((COALESCE(v.salary_from, 0) + COALESCE(v.salary_to, 0)))
                     from public.vacancies as v                                
       where (
       (v.salary_to is not null or v.salary_from is not null) and v.experience = ('От 3 до 6 лет')
       )
       AND (
               (lower(v.name) like '%data_scientist%'
               or lower(v.name) like '%data_science%'
               or lower(v.name) like '%исследователь_данных%'
               or (v.name like '%ML%' and v.key_skills not like '%HTML%')
               or lower(v.name) like '%machine_learning%'
               or lower(v.name) like '%машинн%обучен%')
               )

group by 1, 2

) as Table_A
group by 1
'''

# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_6_6 = pd.read_sql_query(query_6_6, connection)

"and (v.salary_from is not null)"

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\1783093947.py:52: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_6 = pd.read_sql_query(query_6_6, connection)

'and (v.salary_from is not null)'

In [ ]:
# результат запроса
display(df_6_6)

      experience            avg
0  От 3 до 6 лет  312982.785714

In [ ]:
# выводы по предметному анализу
print('К сфере данных имеют отношение 1771 работодателей. Для начинающего дата-сайентиста имеется 51 подходящая вакансияю\
При этом в 201 вакансии для дата-сайнтиста в качестве ключевого навыка указан SQL или postgres. Среди вакансий для дата-сайнтиста\
351 вакансия имеет в качестве ключевого навыка уменени работать на Python. В среднем для DS указывается более 5 навыков.\
Специалист в машинном обучении с опытом работы от 3 до 6 лет может расчитывать на зарплату в районе 300000 тысяч.')

К сфере данных имеют отношение 1771 работодателей. Для начинающего дата-сайентиста имеется 51 подходящая вакансияюПри этом в 201 вакансии для дата-сайнтиста в качестве ключевого навыка указан SQL или postgres. Среди вакансий для дата-сайнтиста351 вакансия имеет в качестве ключевого навыка уменени работать на Python. В среднем для DS указывается более 5 навыков.Специалист в машинном обучении с опытом работы от 3 до 6 лет может расчитывать на зарплату в районе 300000 тысяч.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
print('По результатам настоящего исследовния можно сделать вывод, что рынок труда специалистов по машинному обучению\
       имеет достаточную емкость. Однако наиболее востребованы данные специалисты в крупных городах-миллионниках\
       - производственных и финансовых центрах, что сильно определят географию востребованности вакансий. При этом\
       можно заключить, что молодой специалист имеет реальные шансы на успешный поиск работы, ввиду наличия предложения\
       для специалистов без опыта работы.')



# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы,# 
# продумать варианты продолжения исследования
query_6_7 = f'''select distinct
                     ar.name as rigion_name,
                     v.schedule,
                     avg(COALESCE(v.salary_from, 0) + COALESCE(v.salary_to, 0)) as avg
                     from areas as ar 
                     left join public.vacancies as v on ar.id = v.area_id                             
       where (
              lower(v.name) like '%data%scientist%'
       or lower(v.name) like '%data%science%'
       or lower(v.name) like '%исследователь%данных%'
       or (v.name like '%ML%' and v.key_skills not like '%HTML%')
       or lower(v.name) like '%machine%learning%'
       or lower(v.name) like '%машинн%обучен%')
       and (v.salary_to is not null or v.salary_from is not null)
       group by 1, 2
       order by 3 desc
'''
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df_6_7 = pd.read_sql_query(query_6_7, connection)
# результат запроса
display(df_6_7)

# Доплнтельные выводы:
print('Исходя из результата запроса, можно сделать вывод, что для специалистов в области машинного обучения\
наиболее часто предлагаются вакансии с графиком полный день и удаленная работа. На среднюю заработную плату сильное влияние\
оказывает регион вакансии, а так же, вероятно, и другие факторы как, например, престиж компании и требования к стажу.')

connection.close()

По результатам настоящего исследовния можно сделать вывод, что рынок труда специалистов по машинному обучению       имеет достаточную емкость. Однако наиболее востребованы данные специалисты в крупных городах-миллионниках       - производственных и финансовых центрах, что сильно определят географию востребованности вакансий. При этом       можно заключить, что молодой специалист имеет реальные шансы на успешный поиск работы, ввиду наличия предложения       для специалистов без опыта работы.

C:\Users\ranea\AppData\Local\Temp\ipykernel_20096\3536813939.py:30: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_7 = pd.read_sql_query(query_6_7, connection)

        rigion_name          schedule            avg
0            Москва       Полный день  340111.111111
1      Екатеринбург       Полный день  335000.000000
2            Москва     Гибкий график  335000.000000
3             Псков  Удаленная работа  320000.000000
4            Рязань  Удаленная работа  310000.000000
5            Москва  Удаленная работа  300909.090909
6              Кипр  Удаленная работа  300000.000000
7           Армения       Полный день  268862.666667
8   Санкт-Петербург       Полный день  242166.666667
9            Сербия  Удаленная работа  233794.000000
10           Турция  Удаленная работа  233794.000000
11       Черногория  Удаленная работа  233794.000000
12      Новосибирск       Полный день  230000.000000
13           Рязань     Гибкий график  210000.000000
14         Белгород       Полный день  200000.000000
15           Алматы       Полный день  189173.000000
16  Санкт-Петербург  Удаленная работа  175346.000000
17      Калининград  Удаленная работа  165000.000000
18           Липецк  Удаленная работа  160000.000000
19           Рязань       Полный день  150000.000000
20          Королев       Полный день  130000.000000
21             Киев  Удаленная работа  128587.000000
22            Пермь       Полный день  120000.000000
23      Новосибирск  Удаленная работа  119000.000000
24            Пермь  Удаленная работа   90000.000000
25              Уфа  Удаленная работа   90000.000000
26      Владивосток       Полный день   85000.000000
27       Нур-Султан       Полный день   73228.000000
28            Томск       Полный день   70000.000000
29          Барнаул       Полный день   60000.000000
30           Казань       Полный день   50000.000000
31   Ростов-на-Дону       Полный день   50000.000000
32     Екатеринбург     Гибкий график   37000.000000

Исходя из результата запроса, можно сделать вывод, что для специалистов в области машинного обучениянаиболее часто предлагаются вакансии с графиком полный день и удаленная работа. На среднюю заработную плату сильное влияниеоказывает регион вакансии, а так же, вероятно, и другие факторы как, например, престиж компании и требования к стажу.